Repository: openwall/passwdqc
Catalog: po/*.po
Languages: fi, ka

source: Enter current password:
fi: Anna nykyinen salasana:
ka: შეიყვანეთ მიმდინარე პაროლი:

source: Enter new password:
fi: Anna uusi salasana:
ka: შეიყვანეთ ახალი პაროლი:

source: Re-type new password:
fi: Vahvista uusi salasana:
ka: ხელახლა შეიყვანეთ ახალი პაროლი:

source: System configuration error. Please contact your administrator.
fi: Virheelliset järjestelmäasetukset. Ota yhteyttä järjestelmänvalvojaasi.
ka: სისტემის კონფიგურაციის შეცდომა. გთხოვთ, დაუკავშირდეთ თქვენს ადმინისტრატორს.

source: You can now choose the new password.
fi: Voit nyt valita uuden salasanan.
ka: ახლა შეგიძლიათ აირჩიოთ ახალი პაროლი.

source: You can now choose the new password or passphrase.
fi: Voit nyt valita uuden salasanan tai salalauseen.
ka: ახლა შეგიძლიათ აირჩიოთ ახალი პაროლი ან საკვანძო ფრაზა.

source: A good password should be a mix of upper and lower case letters, digits, and other characters. You can use a password containing at least %d character.
fi: Hyvän salasanan tulisi olla sekoitus isoja ja pieniä kirjaimia, numeroita ja muita merkkejä. Voit käyttää salasanaa, joka sisältää vähintään %d merkin.
ka: კარგი პაროლი უნდა იყოს შედგენილი ზედა და ქვედა რეგისტრის ასოების, ციფრების და სხვა სიმბოლოებისგან. შეგიძლიათ გამოიყენოთ პაროლი, რომელიც შეიცავს მინიმუმ %d სიმბოლოს.

source: A valid password should be a mix of upper and lower case letters, digits, and other characters. You can use a password containing at least %d character from at least %d of these 4 classes. An upper case letter that begins the password and a digit that ends it do not count towards the number of character classes used.
fi: Hyvän salasanan tulisi olla sekoitus isoja ja pieniä kirjaimia, numeroita ja muita merkkejä. Voit käyttää salasanaa, joka sisältää vähintään %d merkin vähintään %d näistä 4 luokasta. Salasanan aloittavaa isoa kirjainta ja sen lopettavaa numeroa ei lasketa mukaan käytettyjen merkkiluokkien määrään.
ka: სწორი პაროლი უნდა წარმოადგენდეს დიდი და პატარა რეგისტრის ასოების, ციფრებისა და სხვა სიმბოლოების ნარევს. შეგიძლიათ გამოიყენოთ მაქსიმუმ %d სიმბოლო, %d კლასიდან. დიდი რეგისტრის სიმბოლო და დამამთავრებელი ციფრი არ ითვლება გამოყენებული კლასების რაოდენობაში.

source: A valid password should be a mix of upper and lower case letters, digits, and other characters. You can use a password containing at least %d character from all of these classes. An upper case letter that begins the password and a digit that ends it do not count towards the number of character classes used.
fi: Hyvän salasanan tulisi olla sekoitus isoja ja pieniä kirjaimia, numeroita ja muita merkkejä. Voit käyttää salasanaa, joka sisältää vähintään %d merkin kaikista näistä luokista. Salasanan aloittavaa isoa kirjainta ja sen lopettavaa numeroa ei lasketa mukaan käytettyjen merkkiluokkien määrään.
ka: სწორი პაროლი უნდა წარმოადგენდეს დიდი და პატარა რეგისტრის ასოების, ციფრებისა და სხვა სიმბოლოების ნარევს. შეგიძლიათ გამოიყენოთ სულ ცოტა %d სიმბოლო, ყველა კლასიდან. დიდი რეგისტრის სიმბოლო და დამამთავრებელი ციფრი არ ითვლება გამოყენებული კლასების რაოდენობაში.

source: A valid password should be a mix of upper and lower case letters, digits, and other characters. You can use a password containing at least %d character from all of these classes, or a password containing at least %d characters from just 3 of these 4 classes. An upper case letter that begins the password and a digit that ends it do not count towards the number of character classes used.
fi: Hyvän salasanan tulisi olla sekoitus isoja ja pieniä kirjaimia, numeroita ja muita merkkejä. Voit käyttää salasanaa, joka sisältää vähintään %d merkin kaikista näistä luokista, tai salasanaa, joka sisältää vähintään %d merkkiä vain 3 näistä 4 luokasta. Salasanan aloittavaa isoa kirjainta ja sen lopettavaa numeroa ei lasketa mukaan käytettyjen merkkiluokkien määrään.
ka: სწორი პაროლი უნდა წარმოადგენდეს დიდი და პატარა რეგისტრის ასოების, ციფრებისა და სხვა სიმბოლოების ნარევს. შეგიძლიათ გამოიყენოთ მაქსიმუმ %d სიმბლოს, %d კლასიდან. დიდი რეგისტრის სიმბოლო და დამამთავრებელი ციფრი არ ითვლება გამოყენებული კლასების რაოდენობაში.

source: A passphrase should be of at least %d word, %d to %d characters long, and contain enough different characters.
fi: Salalauseen tulisi olla vähintään %d sanan pituinen, %d–%d merkkiä pitkä ja sisältää riittävästi eri merkkejä.
ka: საკვანძო სიტყვა მინიმუმ %d სიტყვას უნდა შეიცავდეს, იყოს %d-%d სიმბოლოს სიგრძის და შეიცავდეს საკმარის განსხვავებულ სიმბოლოებს.

source: Alternatively, if no one else can see your terminal now, you can pick this as your password: "%s".
fi: Vaihtoehtoisesti, jos kukaan muu ei voi nyt nähdä päätettäsi, voit valita tämän salasanaksesi: "%s".
ka: ან, თუ თქვენს ტერმინალს ამ წამს არავინ უყურებს, პაროლად "%s" შეგიძლიათ აიღოთ.

source: This system is configured to permit randomly generated passwords only. If no one else can see your terminal now, you can pick this as your password: "%s". Otherwise come back later.
fi: Tämä järjestelmä on määritetty käyttämään vain satunnaisesti luotuja salasanoja. Jos kukaan muu ei voi nyt nähdä päätettäsi, voit valita tämän salasanaksesi: "%s". Muussa tapauksessa tule myöhemmin takaisin.
ka: სისტემა მორგებულია, რომ მხოლოდ შემთხვევითი პაროლებით შეგიშვათ. თუ თქვენს ტერმინალს ამ წამს არავინ უყურებს, პაროლად შეგიძლიათ "%s" აიღოთ. წინააღმდეგ შემთხვევაში, მოგვიანებით დაბრუნდით.

source: This system is configured to use randomly generated passwords only, but the attempt to generate a password has failed. This could happen for a number of reasons: you could have requested an impossible password length, or the access to kernel random number pool could have failed.
fi: Tämä järjestelmä on määritetty käyttämään vain satunnaisesti luotuja salasanoja, mutta salasanan luontiyritys epäonnistui. Näin voi käydä useista syistä: olet voinut pyytää mahdotonta salasanan pituutta tai pääsy ytimen satunnaislukuvarantoon on voinut epäonnistua.
ka: სისტემა მხოლოდ შემთხევითი პაროლების გამოყენებაზეა მორგებული, მაგრამ პაროლის გენერაციის მცდელობა წარუმატებლად დასრულდა. ეს რამდენიმე მიზეზით შეიძლება მოხდეს: ან მოთხოვნილი პაროლის სიგრძე მიუღებელია, ან შემთხვევითი რიცხვების გენერატორთან წვდომა წარუმატებლად დასრულდა.

source: This password may be too long for some services. Choose another.
fi: Tämä salasana saattaa olla liian pitkä joihinkin palveluihin. Valitse toinen.
ka: ეს პაროლი ზოგიერთი სერვისისთვის შეიძლება ძალიან გრძელია. სხვა აირჩიეთ.

source: Warning: your longer password will be truncated to 8 characters.
fi: Varoitus: sinun pidempi salasanasi lyhennetään 8 merkkiin.
ka: გაფრთხილება: თქვენი გრძელი პაროლი 8 სიმბოლომდე შეიკვეცება.

source: Weak password: %s.
fi: Heikko salasana: %s.
ka: სუსტი პაროლი: %s.

source: Sorry, you've mistyped the password that was generated for you.
fi: Anteeksi, kirjoitit sinulle luodun salasanan väärin.
ka: უკაცრავად, თქვენთვის დაგენერირებული პაროლი არასწორად აკრიფეთ.

source: Sorry, passwords do not match.
fi: Anteeksi, salasanat eivät täsmää.
ka: პაროლები არ ემთხვევა.

source: Try again.
fi: Yritä uudestaan.
ka: კიდევ სცადეთ.

source: check failed
fi: tarkistus epäonnistui
ka: შემოწმების შეცდომა

source: is the same as the old one
fi: on sama kuin vanha salasana
ka: პაროლი იგივეა, რაც მანამდე იყო

source: is based on the old one
fi: perustuu vanhaan salasanaan
ka: დაფუძნებულია ძველზე

source: too short
fi: liian lyhyt
ka: ძალიან მოკლეა

source: too long
fi: liian pitkä
ka: ძალიან გრძელია

source: not enough different characters or classes for this length
fi: ei tarpeeksi eri merkkejä tai merkkiluokkia tälle pituudelle
ka: არასაკმარისი განსხვავებული სიმბოლოები ან კლასები ამ სიგრძისთვის

source: not enough different characters or classes
fi: ei tarpeeksi eri merkkejä tai merkkiluokkia
ka: არასაკმარისი განსხვავებული სიმბოლოები ან კლასები

source: based on personal login information
fi: perustuu henkilökohtaisiin kirjautumistietoihin
ka: დაფუძნებულია შესვლის ინფორმაციაზე

source: based on a dictionary word and not a passphrase
fi: perustuu sanakirjasanaan eikä ole salalause
ka: ეყრდნობა ლექსიკონის სიტყვას და არა საკვანძო ფრაზას

source: based on a common sequence of characters
fi: perustuu yleiseen merkkisarjaan

source: based on a common password
fi: perustuu yleiseen salasanaan

source: based on a word list entry
fi: perustuu sanaluettelomerkintään
ka: დაფუძნებულია სიტყვების სიის ჩანაწერზე

source: is in deny list
fi: on kieltolistassa
ka: აკრძალულ სიაშია

source: appears to be in a database
fi: näyttää olevan tietokannassa
ka: როგორც ჩანს, მონაცემთა ბაზაშია

source: based on a common sequence of characters and not a passphrase
ka: ეყრდნობა სიმბოლოების მიღებულ მიმდევრობას და არა საკვანძო ფრაზას
